ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151fxx_ca7.h
/****************  Bit definition for DDRCTRL_DBGCAM register  ****************/
#define DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_Pos        (0U)
#define DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_Msk        (0x1FU << DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_Pos)       /*!< 0x0000001F */
#define DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH            DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_Msk                  /*!< High priority read queue depth */
#define DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_0          (0x1U << DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_Pos)        /*!< 0x00000001 */
#define DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_1          (0x2U << DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_Pos)        /*!< 0x00000002 */
#define DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_2          (0x4U << DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_Pos)        /*!< 0x00000004 */
#define DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_3          (0x8U << DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_Pos)        /*!< 0x00000008 */
#define DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_4          (0x10U << DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH_Pos)       /*!< 0x00000010 */
#define DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_Pos        (8U)
#define DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_Msk        (0x1FU << DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_Pos)       /*!< 0x00001F00 */
#define DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH            DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_Msk                  /*!< Low priority read queue depth */
#define DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_0          (0x1U << DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_Pos)        /*!< 0x00000100 */
#define DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_1          (0x2U << DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_Pos)        /*!< 0x00000200 */
#define DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_2          (0x4U << DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_Pos)        /*!< 0x00000400 */
#define DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_3          (0x8U << DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_Pos)        /*!< 0x00000800 */
#define DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_4          (0x10U << DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH_Pos)       /*!< 0x00001000 */
#define DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_Pos          (16U)
#define DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_Msk          (0x1FU << DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_Pos)         /*!< 0x001F0000 */
#define DDRCTRL_DBGCAM_DBG_W_Q_DEPTH              DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_Msk                    /*!< Write queue depth */
#define DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_0            (0x1U << DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_Pos)          /*!< 0x00010000 */
#define DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_1            (0x2U << DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_Pos)          /*!< 0x00020000 */
#define DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_2            (0x4U << DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_Pos)          /*!< 0x00040000 */
#define DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_3            (0x8U << DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_Pos)          /*!< 0x00080000 */
#define DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_4            (0x10U << DDRCTRL_DBGCAM_DBG_W_Q_DEPTH_Pos)         /*!< 0x00100000 */
#define DDRCTRL_DBGCAM_DBG_STALL_Pos              (24U)
#define DDRCTRL_DBGCAM_DBG_STALL_Msk              (0x1U << DDRCTRL_DBGCAM_DBG_STALL_Pos)              /*!< 0x01000000 */
#define DDRCTRL_DBGCAM_DBG_STALL                  DDRCTRL_DBGCAM_DBG_STALL_Msk                        /*!< Stall */
#define DDRCTRL_DBGCAM_DBG_RD_Q_EMPTY_Pos         (25U)
#define DDRCTRL_DBGCAM_DBG_RD_Q_EMPTY_Msk         (0x1U << DDRCTRL_DBGCAM_DBG_RD_Q_EMPTY_Pos)         /*!< 0x02000000 */
#define DDRCTRL_DBGCAM_DBG_RD_Q_EMPTY             DDRCTRL_DBGCAM_DBG_RD_Q_EMPTY_Msk                   /*!< When 1, all the Read command queues and Read data buffers inside DDRC are empty. This register is to be used for debug purpose. */
#define DDRCTRL_DBGCAM_DBG_WR_Q_EMPTY_Pos         (26U)
#define DDRCTRL_DBGCAM_DBG_WR_Q_EMPTY_Msk         (0x1U << DDRCTRL_DBGCAM_DBG_WR_Q_EMPTY_Pos)         /*!< 0x04000000 */
#define DDRCTRL_DBGCAM_DBG_WR_Q_EMPTY             DDRCTRL_DBGCAM_DBG_WR_Q_EMPTY_Msk                   /*!< When 1, all the Write command queues and Write data buffers inside DDRC are empty. This register is to be used for debug purpose. */
#define DDRCTRL_DBGCAM_RD_DATA_PIPELINE_EMPTY_Pos (28U)
#define DDRCTRL_DBGCAM_RD_DATA_PIPELINE_EMPTY_Msk (0x1U << DDRCTRL_DBGCAM_RD_DATA_PIPELINE_EMPTY_Pos) /*!< 0x10000000 */
#define DDRCTRL_DBGCAM_RD_DATA_PIPELINE_EMPTY     DDRCTRL_DBGCAM_RD_DATA_PIPELINE_EMPTY_Msk           /*!< This bit indicates that the read data pipeline on the DFI interface is empty. This register is intended to be polled at least twice after setting DBG1.dis_dq, to ensure that all remaining commands/data have completed. */
#define DDRCTRL_DBGCAM_WR_DATA_PIPELINE_EMPTY_Pos (29U)
#define DDRCTRL_DBGCAM_WR_DATA_PIPELINE_EMPTY_Msk (0x1U << DDRCTRL_DBGCAM_WR_DATA_PIPELINE_EMPTY_Pos) /*!< 0x20000000 */
#define DDRCTRL_DBGCAM_WR_DATA_PIPELINE_EMPTY     DDRCTRL_DBGCAM_WR_DATA_PIPELINE_EMPTY_Msk           /*!< This bit indicates that the write data pipeline on the DFI interface is empty. This register is intended to be polled at least twice after setting DBG1.dis_dq, to ensure that all remaining commands/data have completed. */

/****************  Bit definition for DDRCTRL_DBGCMD register  ****************/
#define DDRCTRL_DBGCMD_RANK0_REFRESH_Pos  (0U)
#define DDRCTRL_DBGCMD_RANK0_REFRESH_Msk  (0x1U << DDRCTRL_DBGCMD_RANK0_REFRESH_Pos)  /*!< 0x00000001 */
#define DDRCTRL_DBGCMD_RANK0_REFRESH      DDRCTRL_DBGCMD_RANK0_REFRESH_Msk            /*!< Setting this register bit to 1 indicates to the DDRCTRL to issue a refresh to rank 0. Writing to this bit causes DBGSTAT.rank0_refresh_busy to be set. When DBGSTAT.rank0_refresh_busy is cleared, the command has been stored in DDRCTRL. */
#define DDRCTRL_DBGCMD_ZQ_CALIB_SHORT_Pos (4U)
#define DDRCTRL_DBGCMD_ZQ_CALIB_SHORT_Msk (0x1U << DDRCTRL_DBGCMD_ZQ_CALIB_SHORT_Pos) /*!< 0x00000010 */
#define DDRCTRL_DBGCMD_ZQ_CALIB_SHORT     DDRCTRL_DBGCMD_ZQ_CALIB_SHORT_Msk           /*!< Setting this register bit to 1 indicates to the DDRCTRL to issue a ZQCS (ZQ calibration short)/MPC(ZQ calibration) command to the SDRAM. When this request is stored in the DDRCTRL, the bit is automatically cleared. This operation can be performed only when ZQCTL0.dis_auto_zq=1. It is recommended NOT to set this register bit if in Init, in Self-Refresh(except LPDDR4) or SR-Powerdown(LPDDR4) or Deep power-down operating modes or maximum power saving mode. */
#define DDRCTRL_DBGCMD_CTRLUPD_Pos        (5U)
#define DDRCTRL_DBGCMD_CTRLUPD_Msk        (0x1U << DDRCTRL_DBGCMD_CTRLUPD_Pos)        /*!< 0x00000020 */
#define DDRCTRL_DBGCMD_CTRLUPD            DDRCTRL_DBGCMD_CTRLUPD_Msk                  /*!< Setting this register bit to 1 indicates to the DDRCTRL to issue a dfi_ctrlupd_req to the PHY. When this request is stored in the DDRCTRL, the bit is automatically cleared. This operation must only be performed when DFIUPD0.dis_auto_ctrlupd=1. */

/***************  Bit definition for DDRCTRL_DBGSTAT register  ****************/
#define DDRCTRL_DBGSTAT_RANK0_REFRESH_BUSY_Pos  (0U)
#define DDRCTRL_DBGSTAT_RANK0_REFRESH_BUSY_Msk  (0x1U << DDRCTRL_DBGSTAT_RANK0_REFRESH_BUSY_Pos)  /*!< 0x00000001 */
#define DDRCTRL_DBGSTAT_RANK0_REFRESH_BUSY      DDRCTRL_DBGSTAT_RANK0_REFRESH_BUSY_Msk            /*!< SoC core may initiate a rank0_refresh operation (refresh operation to rank 0) only if this signal is low. This signal goes high in the clock after DBGCMD.rank0_refresh is set to one. It goes low when the rank0_refresh operation is stored in the DDRCTRL. It is recommended not to perform rank0_refresh operations when this signal is high. */
#define DDRCTRL_DBGSTAT_ZQ_CALIB_SHORT_BUSY_Pos (4U)
#define DDRCTRL_DBGSTAT_ZQ_CALIB_SHORT_BUSY_Msk (0x1U << DDRCTRL_DBGSTAT_ZQ_CALIB_SHORT_BUSY_Pos) /*!< 0x00000010 */
#define DDRCTRL_DBGSTAT_ZQ_CALIB_SHORT_BUSY     DDRCTRL_DBGSTAT_ZQ_CALIB_SHORT_BUSY_Msk           /*!< SoC core may initiate a ZQCS (ZQ calibration short) operation only if this signal is low. This signal goes high in the clock after the DDRCTRL accepts the ZQCS request. It goes low when the ZQCS operation is initiated in the DDRCTRL. It is recommended not to perform ZQCS operations when this signal is high. */
#define DDRCTRL_DBGSTAT_CTRLUPD_BUSY_Pos        (5U)
#define DDRCTRL_DBGSTAT_CTRLUPD_BUSY_Msk        (0x1U << DDRCTRL_DBGSTAT_CTRLUPD_BUSY_Pos)        /*!< 0x00000020 */
#define DDRCTRL_DBGSTAT_CTRLUPD_BUSY            DDRCTRL_DBGSTAT_CTRLUPD_BUSY_Msk                  /*!< SoC core may initiate a ctrlupd operation only if this signal is low. This signal goes high in the clock after the DDRCTRL accepts the ctrlupd request. It goes low when the ctrlupd operation is initiated in the DDRCTRL. It is recommended not to perform ctrlupd operations when this signal is high. */

/****************  Bit definition for DDRCTRL_SWCTL register  *****************/
#define DDRCTRL_SWCTL_SW_DONE_Pos (0U)
#define DDRCTRL_SWCTL_SW_DONE_Msk (0x1U << DDRCTRL_SWCTL_SW_DONE_Pos) /*!< 0x00000001 */
#define DDRCTRL_SWCTL_SW_DONE     DDRCTRL_SWCTL_SW_DONE_Msk           /*!< Enable quasi-dynamic register programming outside reset. Program register to 0 to enable quasi-dynamic programming. Set back register to 1 once programming is done. */

/****************  Bit definition for DDRCTRL_SWSTAT register  ****************/
#define DDRCTRL_SWSTAT_SW_DONE_ACK_Pos (0U)
#define DDRCTRL_SWSTAT_SW_DONE_ACK_Msk (0x1U << DDRCTRL_SWSTAT_SW_DONE_ACK_Pos) /*!< 0x00000001 */
#define DDRCTRL_SWSTAT_SW_DONE_ACK     DDRCTRL_SWSTAT_SW_DONE_ACK_Msk           /*!< Register programming done. This register is the echo of SWCTL.sw_done. Wait for sw_done value 1 to propagate to sw_done_ack at the end of the programming sequence to ensure that the correct registers values are propagated to the destination clock domains. */

/**************  Bit definition for DDRCTRL_POISONCFG register  ***************/
#define DDRCTRL_POISONCFG_WR_POISON_SLVERR_EN_Pos (0U)
#define DDRCTRL_POISONCFG_WR_POISON_SLVERR_EN_Msk (0x1U << DDRCTRL_POISONCFG_WR_POISON_SLVERR_EN_Pos) /*!< 0x00000001 */
#define DDRCTRL_POISONCFG_WR_POISON_SLVERR_EN     DDRCTRL_POISONCFG_WR_POISON_SLVERR_EN_Msk           /*!< If set to 1, enables SLVERR response for write transaction poisoning */
#define DDRCTRL_POISONCFG_WR_POISON_INTR_EN_Pos   (4U)
#define DDRCTRL_POISONCFG_WR_POISON_INTR_EN_Msk   (0x1U << DDRCTRL_POISONCFG_WR_POISON_INTR_EN_Pos)   /*!< 0x00000010 */
#define DDRCTRL_POISONCFG_WR_POISON_INTR_EN       DDRCTRL_POISONCFG_WR_POISON_INTR_EN_Msk             /*!< If set to 1, enables interrupts for write transaction poisoning */
#define DDRCTRL_POISONCFG_WR_POISON_INTR_CLR_Pos  (8U)
#define DDRCTRL_POISONCFG_WR_POISON_INTR_CLR_Msk  (0x1U << DDRCTRL_POISONCFG_WR_POISON_INTR_CLR_Pos)  /*!< 0x00000100 */
#define DDRCTRL_POISONCFG_WR_POISON_INTR_CLR      DDRCTRL_POISONCFG_WR_POISON_INTR_CLR_Msk            /*!< Interrupt clear for write transaction poisoning. Allow 2/3 clock cycles for correct value to propagate to core logic and clear the interrupts. */
#define DDRCTRL_POISONCFG_RD_POISON_SLVERR_EN_Pos (16U)
#define DDRCTRL_POISONCFG_RD_POISON_SLVERR_EN_Msk (0x1U << DDRCTRL_POISONCFG_RD_POISON_SLVERR_EN_Pos) /*!< 0x00010000 */
#define DDRCTRL_POISONCFG_RD_POISON_SLVERR_EN     DDRCTRL_POISONCFG_RD_POISON_SLVERR_EN_Msk           /*!< If set to 1, enables SLVERR response for read transaction poisoning */
#define DDRCTRL_POISONCFG_RD_POISON_INTR_EN_Pos   (20U)
#define DDRCTRL_POISONCFG_RD_POISON_INTR_EN_Msk   (0x1U << DDRCTRL_POISONCFG_RD_POISON_INTR_EN_Pos)   /*!< 0x00100000 */
#define DDRCTRL_POISONCFG_RD_POISON_INTR_EN       DDRCTRL_POISONCFG_RD_POISON_INTR_EN_Msk             /*!< If set to 1, enables interrupts for read transaction poisoning */
#define DDRCTRL_POISONCFG_RD_POISON_INTR_CLR_Pos  (24U)
#define DDRCTRL_POISONCFG_RD_POISON_INTR_CLR_Msk  (0x1U << DDRCTRL_POISONCFG_RD_POISON_INTR_CLR_Pos)  /*!< 0x01000000 */
#define DDRCTRL_POISONCFG_RD_POISON_INTR_CLR      DDRCTRL_POISONCFG_RD_POISON_INTR_CLR_Msk            /*!< Interrupt clear for read transaction poisoning. Allow 2/3 clock cycles for correct value to propagate to core logic and clear the interrupts. */

/**************  Bit definition for DDRCTRL_POISONSTAT register  **************/
#define DDRCTRL_POISONSTAT_WR_POISON_INTR_0_Pos (0U)
#define DDRCTRL_POISONSTAT_WR_POISON_INTR_0_Msk (0x1U << DDRCTRL_POISONSTAT_WR_POISON_INTR_0_Pos) /*!< 0x00000001 */
#define DDRCTRL_POISONSTAT_WR_POISON_INTR_0     DDRCTRL_POISONSTAT_WR_POISON_INTR_0_Msk           /*!< Write transaction poisoning error interrupt for port 0. This register is a APB clock copy (double register synchronizer) of the interrupt asserted when a transaction is poisoned on the corresponding AXI port\qs write address channel. Bit 0 corresponds to Port 0, and so on. Interrupt is cleared by register wr_poison_intr_clr, then value propagated to APB clock. */
#define DDRCTRL_POISONSTAT_WR_POISON_INTR_1_Pos (1U)
#define DDRCTRL_POISONSTAT_WR_POISON_INTR_1_Msk (0x1U << DDRCTRL_POISONSTAT_WR_POISON_INTR_1_Pos) /*!< 0x00000002 */
#define DDRCTRL_POISONSTAT_WR_POISON_INTR_1     DDRCTRL_POISONSTAT_WR_POISON_INTR_1_Msk           /*!< Write transaction poisoning error interrupt for port 1. This register is a APB clock copy (double register synchronizer) of the interrupt asserted when a transaction is poisoned on the corresponding AXI port\qs write address channel. Bit 0 corresponds to Port 0, and so on. Interrupt is cleared by register wr_poison_intr_clr, then value propagated to APB clock. */
#define DDRCTRL_POISONSTAT_RD_POISON_INTR_0_Pos (16U)
#define DDRCTRL_POISONSTAT_RD_POISON_INTR_0_Msk (0x1U << DDRCTRL_POISONSTAT_RD_POISON_INTR_0_Pos) /*!< 0x00010000 */
#define DDRCTRL_POISONSTAT_RD_POISON_INTR_0     DDRCTRL_POISONSTAT_RD_POISON_INTR_0_Msk           /*!< Read transaction poisoning error interrupt for port 0. This register is a APB clock copy (double register synchronizer) of the interrupt asserted when a transaction is poisoned on the corresponding AXI port\qs read address channel. Bit 0 corresponds to Port 0, and so on. Interrupt is cleared by register rd_poison_intr_clr, then value propagated to APB clock. */
#define DDRCTRL_POISONSTAT_RD_POISON_INTR_1_Pos (17U)
#define DDRCTRL_POISONSTAT_RD_POISON_INTR_1_Msk (0x1U << DDRCTRL_POISONSTAT_RD_POISON_INTR_1_Pos) /*!< 0x00020000 */
#define DDRCTRL_POISONSTAT_RD_POISON_INTR_1     DDRCTRL_POISONSTAT_RD_POISON_INTR_1_Msk           /*!< Read transaction poisoning error interrupt for port 1. This register is a APB clock copy (double register synchronizer) of the interrupt asserted when a transaction is poisoned on the corresponding AXI port\qs read address channel. Bit 0 corresponds to Port 0, and so on. Interrupt is cleared by register rd_poison_intr_clr, then value propagated to APB clock. */

/****************  Bit definition for DDRCTRL_PSTAT register  *****************/
#define DDRCTRL_PSTAT_RD_PORT_BUSY_0_Pos (0U)
#define DDRCTRL_PSTAT_RD_PORT_BUSY_0_Msk (0x1U << DDRCTRL_PSTAT_RD_PORT_BUSY_0_Pos) /*!< 0x00000001 */
#define DDRCTRL_PSTAT_RD_PORT_BUSY_0     DDRCTRL_PSTAT_RD_PORT_BUSY_0_Msk           /*!< Indicates if there are outstanding reads for AXI port 0. */
#define DDRCTRL_PSTAT_RD_PORT_BUSY_1_Pos (1U)
#define DDRCTRL_PSTAT_RD_PORT_BUSY_1_Msk (0x1U << DDRCTRL_PSTAT_RD_PORT_BUSY_1_Pos) /*!< 0x00000002 */
#define DDRCTRL_PSTAT_RD_PORT_BUSY_1     DDRCTRL_PSTAT_RD_PORT_BUSY_1_Msk           /*!< Indicates if there are outstanding reads for AXI port 1. */
#define DDRCTRL_PSTAT_WR_PORT_BUSY_0_Pos (16U)
#define DDRCTRL_PSTAT_WR_PORT_BUSY_0_Msk (0x1U << DDRCTRL_PSTAT_WR_PORT_BUSY_0_Pos) /*!< 0x00010000 */
#define DDRCTRL_PSTAT_WR_PORT_BUSY_0     DDRCTRL_PSTAT_WR_PORT_BUSY_0_Msk           /*!< Indicates if there are outstanding writes for AXI port 0. */
#define DDRCTRL_PSTAT_WR_PORT_BUSY_1_Pos (17U)
#define DDRCTRL_PSTAT_WR_PORT_BUSY_1_Msk (0x1U << DDRCTRL_PSTAT_WR_PORT_BUSY_1_Pos) /*!< 0x00020000 */
#define DDRCTRL_PSTAT_WR_PORT_BUSY_1     DDRCTRL_PSTAT_WR_PORT_BUSY_1_Msk           /*!< Indicates if there are outstanding writes for AXI port 1. */

/****************  Bit definition for DDRCTRL_PCCFG register  *****************/
#define DDRCTRL_PCCFG_GO2CRITICAL_EN_Pos  (0U)
#define DDRCTRL_PCCFG_GO2CRITICAL_EN_Msk  (0x1U << DDRCTRL_PCCFG_GO2CRITICAL_EN_Pos) /*!< 0x00000001 */
#define DDRCTRL_PCCFG_GO2CRITICAL_EN      DDRCTRL_PCCFG_GO2CRITICAL_EN_Msk           /*!< If set to 1 (enabled), sets co_gs_go2critical_wr and co_gs_go2critical_lpr/co_gs_go2critical_hpr signals going to DDRC based on urgent input (awurgent, arurgent) coming from AXI master. If set to 0 (disabled), co_gs_go2critical_wr and co_gs_go2critical_lpr/co_gs_go2critical_hpr signals at DDRC are driven to 1b\q0. */
#define DDRCTRL_PCCFG_PAGEMATCH_LIMIT_Pos (4U)
#define DDRCTRL_PCCFG_PAGEMATCH_LIMIT_Msk (0x1U << DDRCTRL_PCCFG_PAGEMATCH_LIMIT_Pos) /*!< 0x00000010 */
#define DDRCTRL_PCCFG_PAGEMATCH_LIMIT     DDRCTRL_PCCFG_PAGEMATCH_LIMIT_Msk           /*!< Page match four limit. If set to 1, limits the number of consecutive same page DDRC transactions that can be granted by the Port Arbiter to four when Page Match feature is enabled. If set to 0, there is no limit imposed on number of consecutive same page DDRC transactions. */
#define DDRCTRL_PCCFG_BL_EXP_MODE_Pos     (8U)
#define DDRCTRL_PCCFG_BL_EXP_MODE_Msk     (0x1U << DDRCTRL_PCCFG_BL_EXP_MODE_Pos)     /*!< 0x00000100 */
#define DDRCTRL_PCCFG_BL_EXP_MODE         DDRCTRL_PCCFG_BL_EXP_MODE_Msk               /*!< Burst length expansion mode. By default (i.e. bl_exp_mode==0) XPI expands every AXI burst into multiple HIF commands, using the memory burst length as a unit. If set to 1, then XPI uses half of the memory burst length as a unit. */

/***************  Bit definition for DDRCTRL_PCFGR_0 register  ****************/
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos     (0U)
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Msk     (0x3FFU << DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos)   /*!< 0x000003FF */
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY         DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Msk               /*!< Determines the initial load value of read aging counters. These counters are parallel loaded after reset, or after each grant to the corresponding port. The aging counters down-count every clock cycle where the port is requesting but not granted. The higher significant 5-bits of the read aging counter sets the priority of the read channel of a given port. Port\qs priority increases as the higher significant 5-bits of the counter starts to decrease. When the aging counter becomes 0, the corresponding port channel has the highest priority level (timeout condition - Priority0). For multi-port configurations, the aging counters cannot be used to set port priorities when external dynamic priority inputs (arqos) are enabled (timeout is still applicable). For single port configurations, the aging counters are only used when they timeout (become 0) to force read-write direction switching. In this case, external dynamic priority input, arqos (for reads only) can still be used to set the DDRC read priority (2 priority levels: low priority read - LPR, high priority read - HPR) on a command by command basis. */
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_0       (0x1U << DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos)     /*!< 0x00000001 */
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_1       (0x2U << DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos)     /*!< 0x00000002 */
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_2       (0x4U << DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos)     /*!< 0x00000004 */
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_3       (0x8U << DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos)     /*!< 0x00000008 */
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_4       (0x10U << DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos)    /*!< 0x00000010 */
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_5       (0x20U << DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos)    /*!< 0x00000020 */
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_6       (0x40U << DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos)    /*!< 0x00000040 */
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_7       (0x80U << DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos)    /*!< 0x00000080 */
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_8       (0x100U << DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos)   /*!< 0x00000100 */
#define DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_9       (0x200U << DDRCTRL_PCFGR_0_RD_PORT_PRIORITY_Pos)   /*!< 0x00000200 */
#define DDRCTRL_PCFGR_0_RD_PORT_AGING_EN_Pos     (12U)
#define DDRCTRL_PCFGR_0_RD_PORT_AGING_EN_Msk     (0x1U << DDRCTRL_PCFGR_0_RD_PORT_AGING_EN_Pos)     /*!< 0x00001000 */
#define DDRCTRL_PCFGR_0_RD_PORT_AGING_EN         DDRCTRL_PCFGR_0_RD_PORT_AGING_EN_Msk               /*!< If set to 1, enables aging function for the read channel of the port. */
#define DDRCTRL_PCFGR_0_RD_PORT_URGENT_EN_Pos    (13U)
#define DDRCTRL_PCFGR_0_RD_PORT_URGENT_EN_Msk    (0x1U << DDRCTRL_PCFGR_0_RD_PORT_URGENT_EN_Pos)    /*!< 0x00002000 */
#define DDRCTRL_PCFGR_0_RD_PORT_URGENT_EN        DDRCTRL_PCFGR_0_RD_PORT_URGENT_EN_Msk              /*!< If set to 1, enables the AXI urgent sideband signal (arurgent). When enabled and arurgent is asserted by the master, that port becomes the highest priority and co_gs_go2critical_lpr/co_gs_go2critical_hpr signal to DDRC is asserted if enabled in PCCFG.go2critical_en register. Note that arurgent signal can be asserted anytime and as long as required which is independent of address handshaking (it is not associated with any particular command). */
#define DDRCTRL_PCFGR_0_RD_PORT_PAGEMATCH_EN_Pos (14U)
#define DDRCTRL_PCFGR_0_RD_PORT_PAGEMATCH_EN_Msk (0x1U << DDRCTRL_PCFGR_0_RD_PORT_PAGEMATCH_EN_Pos) /*!< 0x00004000 */
#define DDRCTRL_PCFGR_0_RD_PORT_PAGEMATCH_EN     DDRCTRL_PCFGR_0_RD_PORT_PAGEMATCH_EN_Msk           /*!< If set to 1, enables the Page Match feature. If enabled, once a requesting port is granted, the port is continued to be granted if the following immediate commands are to the same memory page (same bank and same row). See also related PCCFG.pagematch_limit register. */
#define DDRCTRL_PCFGR_0_RDWR_ORDERED_EN_Pos      (16U)
#define DDRCTRL_PCFGR_0_RDWR_ORDERED_EN_Msk      (0x1U << DDRCTRL_PCFGR_0_RDWR_ORDERED_EN_Pos)      /*!< 0x00010000 */
#define DDRCTRL_PCFGR_0_RDWR_ORDERED_EN          DDRCTRL_PCFGR_0_RDWR_ORDERED_EN_Msk                /*!< Enables ordered read/writes. If set to 1, preserves the ordering between read transaction and write transaction issued to the same address, on a given port. In other words, the controller ensures that all same address read and write commands from the application port interface are transported to the DFI interface in the order of acceptance. This feature is useful in cases where software coherency is desired for masters issuing back-to-back read/write transactions without waiting for write/read responses. Note that this register has an effect only if necessary logic is instantiated via the UMCTL2_RDWR_ORDERED_n parameter. */

