ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151fxx_ca7.h
/*************  Bit definition for RCC_MP_APB4LPENSETR register  **************/
#define RCC_MP_APB4LPENSETR_LTDCLPEN_Pos          (0U)
#define RCC_MP_APB4LPENSETR_LTDCLPEN_Msk          (0x1U << RCC_MP_APB4LPENSETR_LTDCLPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_APB4LPENSETR_LTDCLPEN              RCC_MP_APB4LPENSETR_LTDCLPEN_Msk                   /*!< LTDC peripheral clocks enable during CSleep mode */
#define RCC_MP_APB4LPENSETR_DSILPEN_Pos           (4U)
#define RCC_MP_APB4LPENSETR_DSILPEN_Msk           (0x1U << RCC_MP_APB4LPENSETR_DSILPEN_Pos)          /*!< 0x00000010 */
#define RCC_MP_APB4LPENSETR_DSILPEN               RCC_MP_APB4LPENSETR_DSILPEN_Msk                    /*!< DSI peripheral clocks enable during CSleep mode */
#define RCC_MP_APB4LPENSETR_DDRPERFMLPEN_Pos      (8U)
#define RCC_MP_APB4LPENSETR_DDRPERFMLPEN_Msk      (0x1U << RCC_MP_APB4LPENSETR_DDRPERFMLPEN_Pos)     /*!< 0x00000100 */
#define RCC_MP_APB4LPENSETR_DDRPERFMLPEN          RCC_MP_APB4LPENSETR_DDRPERFMLPEN_Msk               /*!< DDRPERFM APB clock enable during CSleep mode */
#define RCC_MP_APB4LPENSETR_IWDG2APBLPEN_Pos      (15U)
#define RCC_MP_APB4LPENSETR_IWDG2APBLPEN_Msk      (0x1U << RCC_MP_APB4LPENSETR_IWDG2APBLPEN_Pos)     /*!< 0x00008000 */
#define RCC_MP_APB4LPENSETR_IWDG2APBLPEN          RCC_MP_APB4LPENSETR_IWDG2APBLPEN_Msk               /*!< IWDG2 APB clock enable during CSleep mode */
#define RCC_MP_APB4LPENSETR_USBPHYLPEN_Pos        (16U)
#define RCC_MP_APB4LPENSETR_USBPHYLPEN_Msk        (0x1U << RCC_MP_APB4LPENSETR_USBPHYLPEN_Pos)       /*!< 0x00010000 */
#define RCC_MP_APB4LPENSETR_USBPHYLPEN            RCC_MP_APB4LPENSETR_USBPHYLPEN_Msk                 /*!< USBPHYC peripheral clocks enable during CSleep mode */
#define RCC_MP_APB4LPENSETR_STGENROLPEN_Pos       (20U)
#define RCC_MP_APB4LPENSETR_STGENROLPEN_Msk       (0x1U << RCC_MP_APB4LPENSETR_STGENROLPEN_Pos)      /*!< 0x00100000 */
#define RCC_MP_APB4LPENSETR_STGENROLPEN           RCC_MP_APB4LPENSETR_STGENROLPEN_Msk                /*!< STGEN Read-Only Interface peripheral clocks enable during CSleep mode */
#define RCC_MP_APB4LPENSETR_STGENROSTPEN_Pos      (21U)
#define RCC_MP_APB4LPENSETR_STGENROSTPEN_Msk      (0x1U << RCC_MP_APB4LPENSETR_STGENROSTPEN_Pos)     /*!< 0x00200000 */
#define RCC_MP_APB4LPENSETR_STGENROSTPEN          RCC_MP_APB4LPENSETR_STGENROSTPEN_Msk               /*!< STGEN Read-Only Interface, clock enable during CStop mode */

/*************  Bit definition for RCC_MP_APB4LPENCLRR register  **************/
#define RCC_MP_APB4LPENCLRR_LTDCLPEN_Pos          (0U)
#define RCC_MP_APB4LPENCLRR_LTDCLPEN_Msk          (0x1U << RCC_MP_APB4LPENCLRR_LTDCLPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_APB4LPENCLRR_LTDCLPEN              RCC_MP_APB4LPENCLRR_LTDCLPEN_Msk                   /*!< LTDC peripheral clocks enable during CSleep mode */
#define RCC_MP_APB4LPENCLRR_DSILPEN_Pos           (4U)
#define RCC_MP_APB4LPENCLRR_DSILPEN_Msk           (0x1U << RCC_MP_APB4LPENCLRR_DSILPEN_Pos)          /*!< 0x00000010 */
#define RCC_MP_APB4LPENCLRR_DSILPEN               RCC_MP_APB4LPENCLRR_DSILPEN_Msk                    /*!< DSI peripheral clocks enable during CSleep mode */
#define RCC_MP_APB4LPENCLRR_DDRPERFMLPEN_Pos      (8U)
#define RCC_MP_APB4LPENCLRR_DDRPERFMLPEN_Msk      (0x1U << RCC_MP_APB4LPENCLRR_DDRPERFMLPEN_Pos)     /*!< 0x00000100 */
#define RCC_MP_APB4LPENCLRR_DDRPERFMLPEN          RCC_MP_APB4LPENCLRR_DDRPERFMLPEN_Msk               /*!< DDRPERFM APB clock enable during CSleep mode */
#define RCC_MP_APB4LPENCLRR_IWDG2APBLPEN_Pos      (15U)
#define RCC_MP_APB4LPENCLRR_IWDG2APBLPEN_Msk      (0x1U << RCC_MP_APB4LPENCLRR_IWDG2APBLPEN_Pos)     /*!< 0x00008000 */
#define RCC_MP_APB4LPENCLRR_IWDG2APBLPEN          RCC_MP_APB4LPENCLRR_IWDG2APBLPEN_Msk               /*!< IWDG2 APB clock enable during CSleep mode */
#define RCC_MP_APB4LPENCLRR_USBPHYLPEN_Pos        (16U)
#define RCC_MP_APB4LPENCLRR_USBPHYLPEN_Msk        (0x1U << RCC_MP_APB4LPENCLRR_USBPHYLPEN_Pos)       /*!< 0x00010000 */
#define RCC_MP_APB4LPENCLRR_USBPHYLPEN            RCC_MP_APB4LPENCLRR_USBPHYLPEN_Msk                 /*!< USBPHYC peripheral clocks enable during CSleep mode */
#define RCC_MP_APB4LPENCLRR_STGENROLPEN_Pos       (20U)
#define RCC_MP_APB4LPENCLRR_STGENROLPEN_Msk       (0x1U << RCC_MP_APB4LPENCLRR_STGENROLPEN_Pos)      /*!< 0x00100000 */
#define RCC_MP_APB4LPENCLRR_STGENROLPEN           RCC_MP_APB4LPENCLRR_STGENROLPEN_Msk                /*!< STGEN Read-Only Interface peripheral clocks enable during CSleep mode */
#define RCC_MP_APB4LPENCLRR_STGENROSTPEN_Pos      (21U)
#define RCC_MP_APB4LPENCLRR_STGENROSTPEN_Msk      (0x1U << RCC_MP_APB4LPENCLRR_STGENROSTPEN_Pos)     /*!< 0x00200000 */
#define RCC_MP_APB4LPENCLRR_STGENROSTPEN          RCC_MP_APB4LPENCLRR_STGENROSTPEN_Msk               /*!< STGEN Read-Only Interface clock enable during CStop mode */

/*************  Bit definition for RCC_MP_APB5LPENSETR register  **************/
#define RCC_MP_APB5LPENSETR_SPI6LPEN_Pos          (0U)
#define RCC_MP_APB5LPENSETR_SPI6LPEN_Msk          (0x1U << RCC_MP_APB5LPENSETR_SPI6LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_APB5LPENSETR_SPI6LPEN              RCC_MP_APB5LPENSETR_SPI6LPEN_Msk                   /*!< SPI6 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENSETR_I2C4LPEN_Pos          (2U)
#define RCC_MP_APB5LPENSETR_I2C4LPEN_Msk          (0x1U << RCC_MP_APB5LPENSETR_I2C4LPEN_Pos)         /*!< 0x00000004 */
#define RCC_MP_APB5LPENSETR_I2C4LPEN              RCC_MP_APB5LPENSETR_I2C4LPEN_Msk                   /*!< I2C4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENSETR_I2C6LPEN_Pos          (3U)
#define RCC_MP_APB5LPENSETR_I2C6LPEN_Msk          (0x1U << RCC_MP_APB5LPENSETR_I2C6LPEN_Pos)         /*!< 0x00000008 */
#define RCC_MP_APB5LPENSETR_I2C6LPEN              RCC_MP_APB5LPENSETR_I2C6LPEN_Msk                   /*!< I2C6 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENSETR_USART1LPEN_Pos        (4U)
#define RCC_MP_APB5LPENSETR_USART1LPEN_Msk        (0x1U << RCC_MP_APB5LPENSETR_USART1LPEN_Pos)       /*!< 0x00000010 */
#define RCC_MP_APB5LPENSETR_USART1LPEN            RCC_MP_APB5LPENSETR_USART1LPEN_Msk                 /*!< USART1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENSETR_RTCAPBLPEN_Pos        (8U)
#define RCC_MP_APB5LPENSETR_RTCAPBLPEN_Msk        (0x1U << RCC_MP_APB5LPENSETR_RTCAPBLPEN_Pos)       /*!< 0x00000100 */
#define RCC_MP_APB5LPENSETR_RTCAPBLPEN            RCC_MP_APB5LPENSETR_RTCAPBLPEN_Msk                 /*!< RTC APB clock enable during CSleep mode */
#define RCC_MP_APB5LPENSETR_TZC1LPEN_Pos          (11U)
#define RCC_MP_APB5LPENSETR_TZC1LPEN_Msk          (0x1U << RCC_MP_APB5LPENSETR_TZC1LPEN_Pos)         /*!< 0x00000800 */
#define RCC_MP_APB5LPENSETR_TZC1LPEN              RCC_MP_APB5LPENSETR_TZC1LPEN_Msk                   /*!< TZC AXI port 1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENSETR_TZC2LPEN_Pos          (12U)
#define RCC_MP_APB5LPENSETR_TZC2LPEN_Msk          (0x1U << RCC_MP_APB5LPENSETR_TZC2LPEN_Pos)         /*!< 0x00001000 */
#define RCC_MP_APB5LPENSETR_TZC2LPEN              RCC_MP_APB5LPENSETR_TZC2LPEN_Msk                   /*!< TZC AXI port 2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENSETR_TZPCLPEN_Pos          (13U)
#define RCC_MP_APB5LPENSETR_TZPCLPEN_Msk          (0x1U << RCC_MP_APB5LPENSETR_TZPCLPEN_Pos)         /*!< 0x00002000 */
#define RCC_MP_APB5LPENSETR_TZPCLPEN              RCC_MP_APB5LPENSETR_TZPCLPEN_Msk                   /*!< TZPC peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENSETR_IWDG1APBLPEN_Pos      (15U)
#define RCC_MP_APB5LPENSETR_IWDG1APBLPEN_Msk      (0x1U << RCC_MP_APB5LPENSETR_IWDG1APBLPEN_Pos)     /*!< 0x00008000 */
#define RCC_MP_APB5LPENSETR_IWDG1APBLPEN          RCC_MP_APB5LPENSETR_IWDG1APBLPEN_Msk               /*!< IWDG1 APB clock enable during CSleep mode */
#define RCC_MP_APB5LPENSETR_BSECLPEN_Pos          (16U)
#define RCC_MP_APB5LPENSETR_BSECLPEN_Msk          (0x1U << RCC_MP_APB5LPENSETR_BSECLPEN_Pos)         /*!< 0x00010000 */
#define RCC_MP_APB5LPENSETR_BSECLPEN              RCC_MP_APB5LPENSETR_BSECLPEN_Msk                   /*!< BSEC peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENSETR_STGENLPEN_Pos         (20U)
#define RCC_MP_APB5LPENSETR_STGENLPEN_Msk         (0x1U << RCC_MP_APB5LPENSETR_STGENLPEN_Pos)        /*!< 0x00100000 */
#define RCC_MP_APB5LPENSETR_STGENLPEN             RCC_MP_APB5LPENSETR_STGENLPEN_Msk                  /*!< STGEN Controller part, peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENSETR_STGENSTPEN_Pos        (21U)
#define RCC_MP_APB5LPENSETR_STGENSTPEN_Msk        (0x1U << RCC_MP_APB5LPENSETR_STGENSTPEN_Pos)       /*!< 0x00200000 */
#define RCC_MP_APB5LPENSETR_STGENSTPEN            RCC_MP_APB5LPENSETR_STGENSTPEN_Msk                 /*!< STGEN Controller part, peripheral clocks enable during CStop mode */

/*************  Bit definition for RCC_MP_APB5LPENCLRR register  **************/
#define RCC_MP_APB5LPENCLRR_SPI6LPEN_Pos          (0U)
#define RCC_MP_APB5LPENCLRR_SPI6LPEN_Msk          (0x1U << RCC_MP_APB5LPENCLRR_SPI6LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_APB5LPENCLRR_SPI6LPEN              RCC_MP_APB5LPENCLRR_SPI6LPEN_Msk                   /*!< SPI6 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENCLRR_I2C4LPEN_Pos          (2U)
#define RCC_MP_APB5LPENCLRR_I2C4LPEN_Msk          (0x1U << RCC_MP_APB5LPENCLRR_I2C4LPEN_Pos)         /*!< 0x00000004 */
#define RCC_MP_APB5LPENCLRR_I2C4LPEN              RCC_MP_APB5LPENCLRR_I2C4LPEN_Msk                   /*!< I2C4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENCLRR_I2C6LPEN_Pos          (3U)
#define RCC_MP_APB5LPENCLRR_I2C6LPEN_Msk          (0x1U << RCC_MP_APB5LPENCLRR_I2C6LPEN_Pos)         /*!< 0x00000008 */
#define RCC_MP_APB5LPENCLRR_I2C6LPEN              RCC_MP_APB5LPENCLRR_I2C6LPEN_Msk                   /*!< I2C6 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENCLRR_USART1LPEN_Pos        (4U)
#define RCC_MP_APB5LPENCLRR_USART1LPEN_Msk        (0x1U << RCC_MP_APB5LPENCLRR_USART1LPEN_Pos)       /*!< 0x00000010 */
#define RCC_MP_APB5LPENCLRR_USART1LPEN            RCC_MP_APB5LPENCLRR_USART1LPEN_Msk                 /*!< USART1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENCLRR_RTCAPBLPEN_Pos        (8U)
#define RCC_MP_APB5LPENCLRR_RTCAPBLPEN_Msk        (0x1U << RCC_MP_APB5LPENCLRR_RTCAPBLPEN_Pos)       /*!< 0x00000100 */
#define RCC_MP_APB5LPENCLRR_RTCAPBLPEN            RCC_MP_APB5LPENCLRR_RTCAPBLPEN_Msk                 /*!< RTC APB clock enable during CSleep mode */
#define RCC_MP_APB5LPENCLRR_TZC1LPEN_Pos          (11U)
#define RCC_MP_APB5LPENCLRR_TZC1LPEN_Msk          (0x1U << RCC_MP_APB5LPENCLRR_TZC1LPEN_Pos)         /*!< 0x00000800 */
#define RCC_MP_APB5LPENCLRR_TZC1LPEN              RCC_MP_APB5LPENCLRR_TZC1LPEN_Msk                   /*!< TZC AXI port 1 peripheral clocks disable during CSleep mode */
#define RCC_MP_APB5LPENCLRR_TZC2LPEN_Pos          (12U)
#define RCC_MP_APB5LPENCLRR_TZC2LPEN_Msk          (0x1U << RCC_MP_APB5LPENCLRR_TZC2LPEN_Pos)         /*!< 0x00001000 */
#define RCC_MP_APB5LPENCLRR_TZC2LPEN              RCC_MP_APB5LPENCLRR_TZC2LPEN_Msk                   /*!< TZC AXI port 2 peripheral clocks disable during CSleep mode */
#define RCC_MP_APB5LPENCLRR_TZPCLPEN_Pos          (13U)
#define RCC_MP_APB5LPENCLRR_TZPCLPEN_Msk          (0x1U << RCC_MP_APB5LPENCLRR_TZPCLPEN_Pos)         /*!< 0x00002000 */
#define RCC_MP_APB5LPENCLRR_TZPCLPEN              RCC_MP_APB5LPENCLRR_TZPCLPEN_Msk                   /*!< TZPC peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENCLRR_IWDG1APBLPEN_Pos      (15U)
#define RCC_MP_APB5LPENCLRR_IWDG1APBLPEN_Msk      (0x1U << RCC_MP_APB5LPENCLRR_IWDG1APBLPEN_Pos)     /*!< 0x00008000 */
#define RCC_MP_APB5LPENCLRR_IWDG1APBLPEN          RCC_MP_APB5LPENCLRR_IWDG1APBLPEN_Msk               /*!< IWDG1 APB clock enable during CSleep mode */
#define RCC_MP_APB5LPENCLRR_BSECLPEN_Pos          (16U)
#define RCC_MP_APB5LPENCLRR_BSECLPEN_Msk          (0x1U << RCC_MP_APB5LPENCLRR_BSECLPEN_Pos)         /*!< 0x00010000 */
#define RCC_MP_APB5LPENCLRR_BSECLPEN              RCC_MP_APB5LPENCLRR_BSECLPEN_Msk                   /*!< BSEC peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENCLRR_STGENLPEN_Pos         (20U)
#define RCC_MP_APB5LPENCLRR_STGENLPEN_Msk         (0x1U << RCC_MP_APB5LPENCLRR_STGENLPEN_Pos)        /*!< 0x00100000 */
#define RCC_MP_APB5LPENCLRR_STGENLPEN             RCC_MP_APB5LPENCLRR_STGENLPEN_Msk                  /*!< STGEN peripheral clocks enable during CSleep mode */
#define RCC_MP_APB5LPENCLRR_STGENSTPEN_Pos        (21U)
#define RCC_MP_APB5LPENCLRR_STGENSTPEN_Msk        (0x1U << RCC_MP_APB5LPENCLRR_STGENSTPEN_Pos)       /*!< 0x00200000 */
#define RCC_MP_APB5LPENCLRR_STGENSTPEN            RCC_MP_APB5LPENCLRR_STGENSTPEN_Msk                 /*!< STGEN peripheral clocks enable during CStop mode */

/*************  Bit definition for RCC_MP_AHB5LPENSETR register  **************/
#define RCC_MP_AHB5LPENSETR_GPIOZLPEN_Pos         (0U)
#define RCC_MP_AHB5LPENSETR_GPIOZLPEN_Msk         (0x1U << RCC_MP_AHB5LPENSETR_GPIOZLPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_AHB5LPENSETR_GPIOZLPEN             RCC_MP_AHB5LPENSETR_GPIOZLPEN_Msk                  /*!< GPIOZ Secure peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB5LPENSETR_CRYP1LPEN_Pos         (4U)
#define RCC_MP_AHB5LPENSETR_CRYP1LPEN_Msk         (0x1U << RCC_MP_AHB5LPENSETR_CRYP1LPEN_Pos)        /*!< 0x00000010 */
#define RCC_MP_AHB5LPENSETR_CRYP1LPEN             RCC_MP_AHB5LPENSETR_CRYP1LPEN_Msk                  /*!< CRYP1 (3DES/AES1) peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB5LPENSETR_HASH1LPEN_Pos         (5U)
#define RCC_MP_AHB5LPENSETR_HASH1LPEN_Msk         (0x1U << RCC_MP_AHB5LPENSETR_HASH1LPEN_Pos)        /*!< 0x00000020 */
#define RCC_MP_AHB5LPENSETR_HASH1LPEN             RCC_MP_AHB5LPENSETR_HASH1LPEN_Msk                  /*!< HASH1 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB5LPENSETR_RNG1LPEN_Pos          (6U)
#define RCC_MP_AHB5LPENSETR_RNG1LPEN_Msk          (0x1U << RCC_MP_AHB5LPENSETR_RNG1LPEN_Pos)         /*!< 0x00000040 */
#define RCC_MP_AHB5LPENSETR_RNG1LPEN              RCC_MP_AHB5LPENSETR_RNG1LPEN_Msk                   /*!< RNG1 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB5LPENSETR_BKPSRAMLPEN_Pos       (8U)
#define RCC_MP_AHB5LPENSETR_BKPSRAMLPEN_Msk       (0x1U << RCC_MP_AHB5LPENSETR_BKPSRAMLPEN_Pos)      /*!< 0x00000100 */
#define RCC_MP_AHB5LPENSETR_BKPSRAMLPEN           RCC_MP_AHB5LPENSETR_BKPSRAMLPEN_Msk                /*!< BKPSRAM clock enable during CSleep mode */

/*************  Bit definition for RCC_MP_AHB5LPENCLRR register  **************/
#define RCC_MP_AHB5LPENCLRR_GPIOZLPEN_Pos         (0U)
#define RCC_MP_AHB5LPENCLRR_GPIOZLPEN_Msk         (0x1U << RCC_MP_AHB5LPENCLRR_GPIOZLPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_AHB5LPENCLRR_GPIOZLPEN             RCC_MP_AHB5LPENCLRR_GPIOZLPEN_Msk                  /*!< GPIOZ Secure peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB5LPENCLRR_CRYP1LPEN_Pos         (4U)
#define RCC_MP_AHB5LPENCLRR_CRYP1LPEN_Msk         (0x1U << RCC_MP_AHB5LPENCLRR_CRYP1LPEN_Pos)        /*!< 0x00000010 */
#define RCC_MP_AHB5LPENCLRR_CRYP1LPEN             RCC_MP_AHB5LPENCLRR_CRYP1LPEN_Msk                  /*!< CRYP1 (3DES/AES1) peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB5LPENCLRR_HASH1LPEN_Pos         (5U)
#define RCC_MP_AHB5LPENCLRR_HASH1LPEN_Msk         (0x1U << RCC_MP_AHB5LPENCLRR_HASH1LPEN_Pos)        /*!< 0x00000020 */
#define RCC_MP_AHB5LPENCLRR_HASH1LPEN             RCC_MP_AHB5LPENCLRR_HASH1LPEN_Msk                  /*!< HASH1 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB5LPENCLRR_RNG1LPEN_Pos          (6U)
#define RCC_MP_AHB5LPENCLRR_RNG1LPEN_Msk          (0x1U << RCC_MP_AHB5LPENCLRR_RNG1LPEN_Pos)         /*!< 0x00000040 */
#define RCC_MP_AHB5LPENCLRR_RNG1LPEN              RCC_MP_AHB5LPENCLRR_RNG1LPEN_Msk                   /*!< RNG1 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN_Pos       (8U)
#define RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN_Msk       (0x1U << RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN_Pos)      /*!< 0x00000100 */
#define RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN           RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN_Msk                /*!< BKPSRAM clock enable during CSleep mode */

/*************  Bit definition for RCC_MP_AHB6LPENSETR register  **************/
#define RCC_MP_AHB6LPENSETR_MDMALPEN_Pos          (0U)
#define RCC_MP_AHB6LPENSETR_MDMALPEN_Msk          (0x1U << RCC_MP_AHB6LPENSETR_MDMALPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_AHB6LPENSETR_MDMALPEN              RCC_MP_AHB6LPENSETR_MDMALPEN_Msk                   /*!< MDMA peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENSETR_GPULPEN_Pos           (5U)
#define RCC_MP_AHB6LPENSETR_GPULPEN_Msk           (0x1U << RCC_MP_AHB6LPENSETR_GPULPEN_Pos)          /*!< 0x00000020 */
#define RCC_MP_AHB6LPENSETR_GPULPEN               RCC_MP_AHB6LPENSETR_GPULPEN_Msk                    /*!< GPU peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENSETR_ETHCKLPEN_Pos         (7U)
#define RCC_MP_AHB6LPENSETR_ETHCKLPEN_Msk         (0x1U << RCC_MP_AHB6LPENSETR_ETHCKLPEN_Pos)        /*!< 0x00000080 */
#define RCC_MP_AHB6LPENSETR_ETHCKLPEN             RCC_MP_AHB6LPENSETR_ETHCKLPEN_Msk                  /*!< Enable of the Ethernet clock generated by the RCC (eth_ker_ck) during CSleep mode */
#define RCC_MP_AHB6LPENSETR_ETHTXLPEN_Pos         (8U)
#define RCC_MP_AHB6LPENSETR_ETHTXLPEN_Msk         (0x1U << RCC_MP_AHB6LPENSETR_ETHTXLPEN_Pos)        /*!< 0x00000100 */
#define RCC_MP_AHB6LPENSETR_ETHTXLPEN             RCC_MP_AHB6LPENSETR_ETHTXLPEN_Msk                  /*!< Enable of the Ethernet Transmission Clock during CSleep mode */
#define RCC_MP_AHB6LPENSETR_ETHRXLPEN_Pos         (9U)
#define RCC_MP_AHB6LPENSETR_ETHRXLPEN_Msk         (0x1U << RCC_MP_AHB6LPENSETR_ETHRXLPEN_Pos)        /*!< 0x00000200 */
#define RCC_MP_AHB6LPENSETR_ETHRXLPEN             RCC_MP_AHB6LPENSETR_ETHRXLPEN_Msk                  /*!< Enable of the Ethernet Reception Clock during CSleep mode */
#define RCC_MP_AHB6LPENSETR_ETHMACLPEN_Pos        (10U)
#define RCC_MP_AHB6LPENSETR_ETHMACLPEN_Msk        (0x1U << RCC_MP_AHB6LPENSETR_ETHMACLPEN_Pos)       /*!< 0x00000400 */
#define RCC_MP_AHB6LPENSETR_ETHMACLPEN            RCC_MP_AHB6LPENSETR_ETHMACLPEN_Msk                 /*!< Enable of the bus interface clocks for ETH block during CSleep mode */
#define RCC_MP_AHB6LPENSETR_ETHSTPEN_Pos          (11U)
#define RCC_MP_AHB6LPENSETR_ETHSTPEN_Msk          (0x1U << RCC_MP_AHB6LPENSETR_ETHSTPEN_Pos)         /*!< 0x00000800 */
#define RCC_MP_AHB6LPENSETR_ETHSTPEN              RCC_MP_AHB6LPENSETR_ETHSTPEN_Msk                   /*!< ETH peripheral clock enable during CStop mode */
#define RCC_MP_AHB6LPENSETR_FMCLPEN_Pos           (12U)
#define RCC_MP_AHB6LPENSETR_FMCLPEN_Msk           (0x1U << RCC_MP_AHB6LPENSETR_FMCLPEN_Pos)          /*!< 0x00001000 */
#define RCC_MP_AHB6LPENSETR_FMCLPEN               RCC_MP_AHB6LPENSETR_FMCLPEN_Msk                    /*!< FMC peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENSETR_QSPILPEN_Pos          (14U)
#define RCC_MP_AHB6LPENSETR_QSPILPEN_Msk          (0x1U << RCC_MP_AHB6LPENSETR_QSPILPEN_Pos)         /*!< 0x00004000 */
#define RCC_MP_AHB6LPENSETR_QSPILPEN              RCC_MP_AHB6LPENSETR_QSPILPEN_Msk                   /*!< QUADSPI peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENSETR_SDMMC1LPEN_Pos        (16U)
#define RCC_MP_AHB6LPENSETR_SDMMC1LPEN_Msk        (0x1U << RCC_MP_AHB6LPENSETR_SDMMC1LPEN_Pos)       /*!< 0x00010000 */
#define RCC_MP_AHB6LPENSETR_SDMMC1LPEN            RCC_MP_AHB6LPENSETR_SDMMC1LPEN_Msk                 /*!< SDMMC1 and SDMMC1 delay (DLYBSD1) block peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENSETR_SDMMC2LPEN_Pos        (17U)
#define RCC_MP_AHB6LPENSETR_SDMMC2LPEN_Msk        (0x1U << RCC_MP_AHB6LPENSETR_SDMMC2LPEN_Pos)       /*!< 0x00020000 */
#define RCC_MP_AHB6LPENSETR_SDMMC2LPEN            RCC_MP_AHB6LPENSETR_SDMMC2LPEN_Msk                 /*!< SDMMC2 and SDMMC2 delay (DLYBSD2) block peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENSETR_CRC1LPEN_Pos          (20U)
#define RCC_MP_AHB6LPENSETR_CRC1LPEN_Msk          (0x1U << RCC_MP_AHB6LPENSETR_CRC1LPEN_Pos)         /*!< 0x00100000 */
#define RCC_MP_AHB6LPENSETR_CRC1LPEN              RCC_MP_AHB6LPENSETR_CRC1LPEN_Msk                   /*!< CRC1 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB6LPENSETR_USBHLPEN_Pos          (24U)
#define RCC_MP_AHB6LPENSETR_USBHLPEN_Msk          (0x1U << RCC_MP_AHB6LPENSETR_USBHLPEN_Pos)         /*!< 0x01000000 */
#define RCC_MP_AHB6LPENSETR_USBHLPEN              RCC_MP_AHB6LPENSETR_USBHLPEN_Msk                   /*!< USBH peripheral clocks enable during CSleep mode */

