ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151fxx_ca7.h
/**************  Bit definition for RCC_MP_APB1ENCLRR register  ***************/
#define RCC_MP_APB1ENCLRR_TIM2EN_Pos              (0U)
#define RCC_MP_APB1ENCLRR_TIM2EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_TIM2EN_Pos)             /*!< 0x00000001 */
#define RCC_MP_APB1ENCLRR_TIM2EN                  RCC_MP_APB1ENCLRR_TIM2EN_Msk                       /*!< TIM2 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_TIM3EN_Pos              (1U)
#define RCC_MP_APB1ENCLRR_TIM3EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_TIM3EN_Pos)             /*!< 0x00000002 */
#define RCC_MP_APB1ENCLRR_TIM3EN                  RCC_MP_APB1ENCLRR_TIM3EN_Msk                       /*!< TIM3 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_TIM4EN_Pos              (2U)
#define RCC_MP_APB1ENCLRR_TIM4EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_TIM4EN_Pos)             /*!< 0x00000004 */
#define RCC_MP_APB1ENCLRR_TIM4EN                  RCC_MP_APB1ENCLRR_TIM4EN_Msk                       /*!< TIM4 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_TIM5EN_Pos              (3U)
#define RCC_MP_APB1ENCLRR_TIM5EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_TIM5EN_Pos)             /*!< 0x00000008 */
#define RCC_MP_APB1ENCLRR_TIM5EN                  RCC_MP_APB1ENCLRR_TIM5EN_Msk                       /*!< TIM5 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_TIM6EN_Pos              (4U)
#define RCC_MP_APB1ENCLRR_TIM6EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_TIM6EN_Pos)             /*!< 0x00000010 */
#define RCC_MP_APB1ENCLRR_TIM6EN                  RCC_MP_APB1ENCLRR_TIM6EN_Msk                       /*!< TIM6 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_TIM7EN_Pos              (5U)
#define RCC_MP_APB1ENCLRR_TIM7EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_TIM7EN_Pos)             /*!< 0x00000020 */
#define RCC_MP_APB1ENCLRR_TIM7EN                  RCC_MP_APB1ENCLRR_TIM7EN_Msk                       /*!< TIM7 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_TIM12EN_Pos             (6U)
#define RCC_MP_APB1ENCLRR_TIM12EN_Msk             (0x1U << RCC_MP_APB1ENCLRR_TIM12EN_Pos)            /*!< 0x00000040 */
#define RCC_MP_APB1ENCLRR_TIM12EN                 RCC_MP_APB1ENCLRR_TIM12EN_Msk                      /*!< TIM12 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_TIM13EN_Pos             (7U)
#define RCC_MP_APB1ENCLRR_TIM13EN_Msk             (0x1U << RCC_MP_APB1ENCLRR_TIM13EN_Pos)            /*!< 0x00000080 */
#define RCC_MP_APB1ENCLRR_TIM13EN                 RCC_MP_APB1ENCLRR_TIM13EN_Msk                      /*!< TIM13 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_TIM14EN_Pos             (8U)
#define RCC_MP_APB1ENCLRR_TIM14EN_Msk             (0x1U << RCC_MP_APB1ENCLRR_TIM14EN_Pos)            /*!< 0x00000100 */
#define RCC_MP_APB1ENCLRR_TIM14EN                 RCC_MP_APB1ENCLRR_TIM14EN_Msk                      /*!< TIM14 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_LPTIM1EN_Pos            (9U)
#define RCC_MP_APB1ENCLRR_LPTIM1EN_Msk            (0x1U << RCC_MP_APB1ENCLRR_LPTIM1EN_Pos)           /*!< 0x00000200 */
#define RCC_MP_APB1ENCLRR_LPTIM1EN                RCC_MP_APB1ENCLRR_LPTIM1EN_Msk                     /*!< LPTIM1 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_SPI2EN_Pos              (11U)
#define RCC_MP_APB1ENCLRR_SPI2EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_SPI2EN_Pos)             /*!< 0x00000800 */
#define RCC_MP_APB1ENCLRR_SPI2EN                  RCC_MP_APB1ENCLRR_SPI2EN_Msk                       /*!< SPI2 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_SPI3EN_Pos              (12U)
#define RCC_MP_APB1ENCLRR_SPI3EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_SPI3EN_Pos)             /*!< 0x00001000 */
#define RCC_MP_APB1ENCLRR_SPI3EN                  RCC_MP_APB1ENCLRR_SPI3EN_Msk                       /*!< SPI3 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_USART2EN_Pos            (14U)
#define RCC_MP_APB1ENCLRR_USART2EN_Msk            (0x1U << RCC_MP_APB1ENCLRR_USART2EN_Pos)           /*!< 0x00004000 */
#define RCC_MP_APB1ENCLRR_USART2EN                RCC_MP_APB1ENCLRR_USART2EN_Msk                     /*!< USART2 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_USART3EN_Pos            (15U)
#define RCC_MP_APB1ENCLRR_USART3EN_Msk            (0x1U << RCC_MP_APB1ENCLRR_USART3EN_Pos)           /*!< 0x00008000 */
#define RCC_MP_APB1ENCLRR_USART3EN                RCC_MP_APB1ENCLRR_USART3EN_Msk                     /*!< USART3 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_UART4EN_Pos             (16U)
#define RCC_MP_APB1ENCLRR_UART4EN_Msk             (0x1U << RCC_MP_APB1ENCLRR_UART4EN_Pos)            /*!< 0x00010000 */
#define RCC_MP_APB1ENCLRR_UART4EN                 RCC_MP_APB1ENCLRR_UART4EN_Msk                      /*!< UART4 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_UART5EN_Pos             (17U)
#define RCC_MP_APB1ENCLRR_UART5EN_Msk             (0x1U << RCC_MP_APB1ENCLRR_UART5EN_Pos)            /*!< 0x00020000 */
#define RCC_MP_APB1ENCLRR_UART5EN                 RCC_MP_APB1ENCLRR_UART5EN_Msk                      /*!< UART5 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_UART7EN_Pos             (18U)
#define RCC_MP_APB1ENCLRR_UART7EN_Msk             (0x1U << RCC_MP_APB1ENCLRR_UART7EN_Pos)            /*!< 0x00040000 */
#define RCC_MP_APB1ENCLRR_UART7EN                 RCC_MP_APB1ENCLRR_UART7EN_Msk                      /*!< UART7 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_UART8EN_Pos             (19U)
#define RCC_MP_APB1ENCLRR_UART8EN_Msk             (0x1U << RCC_MP_APB1ENCLRR_UART8EN_Pos)            /*!< 0x00080000 */
#define RCC_MP_APB1ENCLRR_UART8EN                 RCC_MP_APB1ENCLRR_UART8EN_Msk                      /*!< UART8 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_I2C1EN_Pos              (21U)
#define RCC_MP_APB1ENCLRR_I2C1EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_I2C1EN_Pos)             /*!< 0x00200000 */
#define RCC_MP_APB1ENCLRR_I2C1EN                  RCC_MP_APB1ENCLRR_I2C1EN_Msk                       /*!< I2C1 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_I2C2EN_Pos              (22U)
#define RCC_MP_APB1ENCLRR_I2C2EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_I2C2EN_Pos)             /*!< 0x00400000 */
#define RCC_MP_APB1ENCLRR_I2C2EN                  RCC_MP_APB1ENCLRR_I2C2EN_Msk                       /*!< I2C2 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_I2C3EN_Pos              (23U)
#define RCC_MP_APB1ENCLRR_I2C3EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_I2C3EN_Pos)             /*!< 0x00800000 */
#define RCC_MP_APB1ENCLRR_I2C3EN                  RCC_MP_APB1ENCLRR_I2C3EN_Msk                       /*!< I2C3 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_I2C5EN_Pos              (24U)
#define RCC_MP_APB1ENCLRR_I2C5EN_Msk              (0x1U << RCC_MP_APB1ENCLRR_I2C5EN_Pos)             /*!< 0x01000000 */
#define RCC_MP_APB1ENCLRR_I2C5EN                  RCC_MP_APB1ENCLRR_I2C5EN_Msk                       /*!< I2C5 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_SPDIFEN_Pos             (26U)
#define RCC_MP_APB1ENCLRR_SPDIFEN_Msk             (0x1U << RCC_MP_APB1ENCLRR_SPDIFEN_Pos)            /*!< 0x04000000 */
#define RCC_MP_APB1ENCLRR_SPDIFEN                 RCC_MP_APB1ENCLRR_SPDIFEN_Msk                      /*!< SPDIFRX peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_CECEN_Pos               (27U)
#define RCC_MP_APB1ENCLRR_CECEN_Msk               (0x1U << RCC_MP_APB1ENCLRR_CECEN_Pos)              /*!< 0x08000000 */
#define RCC_MP_APB1ENCLRR_CECEN                   RCC_MP_APB1ENCLRR_CECEN_Msk                        /*!< HDMI-CEC peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_DAC12EN_Pos             (29U)
#define RCC_MP_APB1ENCLRR_DAC12EN_Msk             (0x1U << RCC_MP_APB1ENCLRR_DAC12EN_Pos)            /*!< 0x20000000 */
#define RCC_MP_APB1ENCLRR_DAC12EN                 RCC_MP_APB1ENCLRR_DAC12EN_Msk                      /*!< DAC1&amp;2 peripheral clocks enable */
#define RCC_MP_APB1ENCLRR_MDIOSEN_Pos             (31U)
#define RCC_MP_APB1ENCLRR_MDIOSEN_Msk             (0x1U << RCC_MP_APB1ENCLRR_MDIOSEN_Pos)            /*!< 0x80000000 */
#define RCC_MP_APB1ENCLRR_MDIOSEN                 RCC_MP_APB1ENCLRR_MDIOSEN_Msk                      /*!< MDIOS peripheral clocks enable */

